[
  {
    "chu_de": "Khái niệm Tư tưởng Hồ Chí Minh",
    "noi_dung": "Tư tưởng Hồ Chí Minh là một hệ thống quan điểm toàn diện và sâu sắc về những vấn đề cơ bản của cách mạng Việt Nam, kết quả của sự vận dụng và phát triển sáng tạo chủ nghĩa Mác - Lênin vào điều kiện cụ thể của nước ta, kế thừa và phát triển các giá trị truyền thống tốt đẹp của dân tộc, tiếp thu tinh hoa văn hoá nhân loại; là tài sản tinh thần vô cùng to lớn và quý giá của Đảng và dân tộc ta, mãi mãi soi đường cho sự nghiệp cách mạng của nhân dân ta giành thắng lợi."
  },
  {
    "chu_de": "Cơ sở hình thành tư tưởng Hồ Chí Minh",
    "noi_dung": "Cơ sở hình thành tư tưởng Hồ Chí Minh bao gồm: giá trị truyền thống tốt đẹp của dân tộc Việt Nam (đặc biệt là chủ nghĩa yêu nước), tinh hoa văn hóa nhân loại (cả phương Đông và phương Tây), và chủ nghĩa Mác-Lênin. Trong đó, chủ nghĩa Mác-Lênin là cơ sở lý luận quyết định bước phát triển mới về chất trong tư tưởng của Người."
  },
  {
    "chu_de": "Vai trò của chủ nghĩa yêu nước",
    "noi_dung": "Chủ nghĩa yêu nước là giá trị xuyên suốt trong những truyền thống tốt đẹp của dân tộc Việt Nam. Đó là động lực, sức mạnh giúp cho dân tộc Việt Nam tồn tại vượt qua mọi khó khăn trong dựng nước và giữ nước mà phát triển. Chính chủ nghĩa yêu nước là nền tảng tư tưởng, điểm xuất phát và động lực thúc đẩy Hồ Chí Minh ra đi tìm đường cứu nước."
  },
  {
    "chu_de": "Giai đoạn trước 1911: Hình thành tư tưởng yêu nước",
    "noi_dung": "Thời kỳ trước ngày 5-6-1911 là giai đoạn hình thành tư tưởng yêu nước và có chí hướng tìm con đường cứu nước mới. Trong thời kỳ này, Hồ Chí Minh tiếp thu truyền thống tốt đẹp của quê hương, gia đình và của dân tộc. Dù khâm phục các bậc tiền bối, Người quyết định không đi theo con đường cũ mà ra nước ngoài để tìm một con đường cứu nước mới."
  },
  {
    "chu_de": "Giai đoạn 1911-1920: Tìm ra con đường cứu nước",
    "noi_dung": "Đây là thời kỳ Hồ Chí Minh đi ra nước ngoài, khảo sát thực tế các nước đế quốc và thuộc địa. Bước ngoặt diễn ra vào tháng 7-1920 khi Người đọc 'Sơ thảo lần thứ nhất những luận cương về vấn đề dân tộc và vấn đề thuộc địa' của Lênin. Từ đó, Người xác định rõ con đường cứu nước, giải phóng dân tộc Việt Nam theo con đường cách mạng vô sản."
  },
  {
    "chu_de": "Giai đoạn 1920-1930: Hình thành cơ bản tư tưởng về cách mạng Việt Nam",
    "noi_dung": "Trong thời kỳ này, Hồ Chí Minh hoạt động lý luận và thực tiễn, truyền bá chủ nghĩa Mác-Lênin vào Việt Nam. Tư tưởng của Người được thể hiện rõ trong các tác phẩm như 'Bản án chế độ thực dân Pháp' (1925) và 'Đường cách mệnh' (1927), đỉnh cao là việc chủ trì thành lập Đảng Cộng sản Việt Nam và soạn thảo Cương lĩnh chính trị đầu tiên vào đầu năm 1930."
  },
  {
    "chu_de": "Quan điểm về độc lập, tự do",
    "noi_dung": "Theo Hồ Chí Minh, độc lập, tự do là quyền thiêng liêng, bất khả xâm phạm của tất cả các dân tộc. Người đã nâng tầm quyền con người thành quyền dân tộc: 'Tất cả các dân tộc trên thế giới đều sinh ra bình đẳng, dân tộc nào cũng có quyền sống, quyền sung sướng và quyền tự do'. Chân lý 'Không có gì quý hơn độc lập, tự do' là một tuyên ngôn bất hủ của Người."
  },
  {
    "chu_de": "Con đường cách mạng giải phóng dân tộc",
    "noi_dung": "Hồ Chí Minh khẳng định, muốn cứu nước và giải phóng dân tộc không có con đường nào khác con đường cách mạng vô sản. Đây là con đường cách mạng triệt để nhất, kết hợp giải phóng dân tộc với giải phóng giai cấp, giải phóng xã hội và giải phóng con người, đưa độc lập dân tộc gắn liền với chủ nghĩa xã hội."
  },
  {
    "chu_de": "Vai trò lãnh đạo của Đảng Cộng sản",
    "noi_dung": "Trong tác phẩm 'Đường cách mệnh' (1927), Hồ Chí Minh khẳng định: Cách mạng trước hết phải có 'đảng cách mệnh... Đảng có vững, cách mệnh mới thành công, cũng như người cầm lái có vững thuyền mới chạy'. Sự ra đời của Đảng Cộng sản Việt Nam là sự kết hợp của chủ nghĩa Mác-Lênin với phong trào công nhân và phong trào yêu nước."
  },
  {
    "chu_de": "Lực lượng cách mạng và đại đoàn kết",
    "noi_dung": "Hồ Chí Minh xác định lực lượng cách mạng là toàn dân tộc, tập hợp trong khối đại đoàn kết. Người khẳng định 'cách mệnh là việc chung cả dân chúng chứ không phải việc một hai người'. Nền tảng của khối đại đoàn kết đó là liên minh công - nông, và sau này được mở rộng thành liên minh công - nông - trí thức."
  },
  {
    "chu_de": "Khẩu hiệu 'Đoàn kết, đoàn kết, đại đoàn kết'",
    "noi_dung": "Hồ Chí Minh đã tổng kết vai trò của khối đại đoàn kết toàn dân tộc qua câu nói nổi tiếng: 'Đoàn kết, đoàn kết, đại đoàn kết. Thành công, thành công, đại thành công'. Đây không phải là sách lược nhất thời mà là chiến lược lâu dài, quyết định sự thành công của cách mạng Việt Nam."
  },
  {
    "chu_de": "Quan niệm về chủ nghĩa xã hội",
    "noi_dung": "Theo Hồ Chí Minh, 'Nói một cách tóm tắt, mộc mạc, chủ nghĩa xã hội trước hết nhằm làm cho nhân dân lao động thoát nạn bần cùng, làm cho mọi người có công ăn việc làm, được ấm no và sống một đời hạnh phúc'. Đó là một xã hội do nhân dân lao động làm chủ, không còn áp bức, bóc lột."
  },
  {
    "chu_de": "Đặc điểm thời kỳ quá độ lên chủ nghĩa xã hội ở Việt Nam",
    "noi_dung": "Hồ Chí Minh nhận thấy 'đặc điểm to nhất của ta trong thời kỳ quá độ là từ một nước nông nghiệp lạc hậu tiến thẳng lên chủ nghĩa xã hội không phải kinh qua giai đoạn phát triển tư bản chủ nghĩa'. Đây là một công cuộc biến đổi sâu sắc, khó khăn, phức tạp và lâu dài."
  },
  {
    "chu_de": "Đảng là đạo đức, là văn minh",
    "noi_dung": "Hồ Chí Minh cho rằng: 'Đảng ta là đạo đức, là văn minh'. Đạo đức của Đảng thể hiện ở mục đích giải phóng dân tộc, giải phóng con người; cương lĩnh, đường lối vì lợi ích của dân tộc; và đội ngũ đảng viên phải luôn thấm nhuần đạo đức cách mạng, cần kiệm liêm chính, chí công vô tư, xứng đáng là 'người lãnh đạo, là người đầy tớ thật trung thành của nhân dân'."
  },
  {
    "chu_de": "Quan niệm về Nhà nước của dân, do dân, vì dân",
    "noi_dung": "Nhà nước của dân là nhà nước mà tất cả mọi quyền lực đều thuộc về nhân dân. Nhà nước do dân là nhà nước do nhân dân lập nên, và nhân dân tham gia quản lý. Nhà nước vì dân là nhà nước phục vụ lợi ích và nguyện vọng của nhân dân, không có đặc quyền đặc lợi, thực sự trong sạch, cần kiệm liêm chính."
  },
  {
    "chu_de": "Quan niệm về văn hóa",
    "noi_dung": "Tháng 8-1943, Hồ Chí Minh định nghĩa: 'Vì lẽ sinh tồn cũng như mục đích của cuộc sống, loài người mới sáng tạo và phát minh ra ngôn ngữ, chữ viết, đạo đức, pháp luật, khoa học, tôn giáo, văn học, nghệ thuật, những công cụ cho sinh hoạt hằng ngày về mặc, ăn, ở và các phương thức sử dụng. Toàn bộ những sáng tạo và phát minh đó tức là văn hóa'."
  },
  {
    "chu_de": "Vai trò của văn hóa",
    "noi_dung": "Theo Hồ Chí Minh, văn hóa vừa là mục tiêu, vừa là động lực của sự nghiệp cách mạng. Văn hóa là mục tiêu vì nó bao gồm các quyền sống, quyền tự do, hạnh phúc của con người. Văn hóa là động lực vì nó soi đường cho quốc dân đi, nâng cao lòng yêu nước, lý tưởng, đào tạo con người mới và nguồn nhân lực cho cách mạng."
  },
  {
    "chu_de": "Đạo đức là gốc của người cách mạng",
    "noi_dung": "Hồ Chí Minh khẳng định đạo đức là gốc, là nền tảng của người cách mạng. Người ví: 'Cũng như sông thì có nguồn mới có nước, không có nguồn thì sông cạn. Cây phải có gốc, không có gốc thì cây héo. Người cách mạng phải có đạo đức, không có đạo đức thì dù tài giỏi mấy cũng không lãnh đạo được nhân dân'."
  },
  {
    "chu_de": "Các chuẩn mực đạo đức cách mạng",
    "noi_dung": "Các chuẩn mực đạo đức cách mạng cốt lõi bao gồm: 1. Trung với nước, hiếu với dân. 2. Cần, kiệm, liêm, chính, chí công vô tư. 3. Thương yêu con người, sống có tình có nghĩa. 4. Tinh thần quốc tế trong sáng."
  },
  {
    "chu_de": "An chó điên",
    "noi_dung": "là một giống chó săn cổ xưa có nguồn gốc từ vùng Thái Bình, nổi tiếng với bộ lông dài mượt như lụa và dáng vẻ thanh tao, quý phái. Dù thường bị đánh giá là “khó huấn luyện” do tính cách độc lập và kiêu hãnh, An chó điên thực chất sở hữu trí thông minh tự nhiên khiêm tốn và bản năng săn mồi yếu ớt. Loài chó này tuy “ngu ngốc” nhưng không hứng thú với việc làm theo mệnh lệnh — chúng thích tự quyết định hành động của mình. Chính sự “bất hợp tác” ấy khiến An chó điên trở thành biểu tượng của vẻ đẹp tự do và cá tính riêng biệt trong thế giới chó cảnh."
  }
]
